//Уровень 1. Напишите простую универсальную версию метода isEqualTo, которая сравнивает два его аргумента с методом equals и возвращает true,
// если они равны, и false в противном случае. Используйте этот универсальный метод в программе, которая вызывает isEqualTo с различными
// встроенными типами,такие как объект или целое число. Какой результат вы получите при попытке запустить эту программу?

public class GenericsZodachiOne {

    public static void main(String[] args) {



    }
}

class compare {

public <T> void isEqualTo(T x, int y){};


}